dot_config/doom/config.org
* Emacs Literate Config Matthew Sampson :TOC:
  - [[#user-level-stuff][User Level Stuff]]
  - [[#exwm][EXWM]]
  - [[#magit][Magit]]
  - [[#org][Org]]
  - [[#projectile][Projectile]]
  - [[#python][Python]]
  - [[#gmail-commented-out-for-now-since-i-dont-have-time-to-setup-my-workflow][Gmail (commented out for now since I don't have time to setup my workflow)]]
  - [[#setting-up-terminal][Setting up terminal]]
  - [[#org-mode][Org-Mode]]
  - [[#org-roam-dailies-copy-done-tasks-to-today-this-code-needs-to-be-debugged][Org-roam dailies copy done tasks to today (this code needs to be debugged)]]
  - [[#org-capture-templates][Org-Capture templates]]
  - [[#note-taking-workflow][Note taking workflow]]
  - [[#org-roam-ui][Org-Roam-UI]]
  - [[#citar--org-roam][Citar + Org-Roam]]
  - [[#lsp][LSP]]

** User Level Stuff
#+begin_src elisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(setq user-full-name "Matthew Sampson"
      user-mail-address "matthew@graywolfai.com")

;;https://github.com/hlissner/doom-emacs-private/blob/064c19884c7a10f2facffda1e33f9ef54880bde6/config.el#L13
(setq display-line-numbers nil)

(setq doom-theme 'doom-vibrant)

;; makes autocomplete manual
(setq company-idle-delay nil)

;; Disable invasive lsp-mode features
(setq lsp-ui-sideline-enable nil
      lsp-ui-doc-enable nil
      lsp-enable-symbol-highlighting nil)

;; Prevents some cases of Emacs flickering
(add-to-list 'default-frame-alist '(inhibit-double-buffering . t))

;;; :editor evil
;; Focus new window after splitting
(setq evil-split-window-below t
      evil-vsplit-window-right t)

(setq fancy-splash-image (concat doom-private-dir "splash.png"))
;; Hide the menu for as minimalistic a startup screen as possible.
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
#+end_src

#+RESULTS:
| doom-dashboard-widget-banner | doom-dashboard-widget-loaded | doom-dashboard-widget-footer |


** EXWM
Followed https://www.youtube.com/watch?v=MquoGuU8sHM for setup
#+begin_src elisp :results silent
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; (require 'exwm)                                                                                   ;;
;; (require 'exwm-config)                                                                            ;;
;; (exwm-config-default)                                                                             ;;
;; (require 'exwm-randr)                                                                             ;;
;; (setq exwm-randr-workspace-output-plist '(0 "Virtual-1"))                                         ;;
;; (add-hook 'exwm-randr-screen-change-hook                                                          ;;
;;         (lambda ()                                                                                ;;
;;           (start-process-shell-command()                                                          ;;
;;            "xrandr" nil "xrandr --output Virtual-1 --mode 1920x1080 --pos 0x0 --rotate normal"))) ;;
;; (exwm-randr-enable)                                                                               ;;
;; (require 'exwm-systemtray)                                                                        ;;
;; (exwm-systemtray-enable)                                                                          ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+end_src


** Magit
#+begin_src elisp
;;; :tools magit
(setq magit-repository-directories '(("~/Projects" . 2))
      magit-save-repository-buffers nil
      ;; Don't restore the wconf after quitting magit, it's jarring
      magit-inhibit-save-previous-winconf t
      transient-values '((magit-rebase "--autosquash" "--autostash")
                         (magit-pull "--rebase" "--autostash")))
;; when using magit, it takes forever
(setq vc-handled-backends nil)

#+end_src

#+RESULTS:

