dot_config/doom/config.org
** Projectile

#+begin_src elisp
(setq projectile-project-search-path '("~/code/" org-directory)
      projectile-sort-order 'recentf)
#+end_src

#+RESULTS:
: recentf

Configuring tracking todo state changes following https://orgmode.org/org.html#Tracking-TODO-state-changes
#+begin_src elisp
(require 'time-stamp)
(after! org
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; (setq org-todo-keywords '((sequence "WAITING" "TODO(@)" "NEXT" "FIGURING-IT-OUT" "MAKING-IT-HAPPEN" "|" "DONE" "CANCELLED"))) ;;
  ;; (setq org-todo-keyword-faces                                                                                                  ;;
  ;;     '(("TODO" . org-warning)                                                                                                  ;;
  ;;       ("NEXT" . "red")                                                                                                        ;;
  ;;       ("DONE" . "green")                                                                                                      ;;
  ;;       ("WAITING" . "yellow")                                                                                                  ;;
  ;;       ("CANCELLED" . "orange")                                                                                                ;;
  ;;       ("FIGURING-IT-OUT" . "red")                                                                                             ;;
  ;;       ("MAKING-IT-HAPPEN" . "red"))))                                                                                         ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; trying from http://doc.norang.ca/org-mode.html#HowToUseThisDocument
 (setq org-todo-keywords
      (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
              (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))

 (setq org-todo-keyword-faces
       (quote (("TODO" :foreground "red" :weight bold)
               ("NEXT" :foreground "blue" :weight bold)
               ("DONE" :foreground "forest green" :weight bold)
               ("WAITING" :foreground "orange" :weight bold)
               ("HOLD" :foreground "magenta" :weight bold)
               ("CANCELLED" :foreground "forest green" :weight bold)
               ("MEETING" :foreground "forest green" :weight bold)
               ("PHONE" :foreground "forest green" :weight bold))))
 (setq org-use-fast-todo-selection t)
 (setq time-stamp-active t
       time-stamp-start "#\\+last_modified: [ \t]*"
       time-stamp-end "$"
       time-stamp-format "\[%04y-%02m-%02d %3a %02H:%02M\]")
 (add-hook 'before-save-hook 'time-stamp nil))

;; from http://doc.norang.ca/org-mode.html#HowToUseThisDocument
;; allows changing todo states with S-left and S-right skipping all of the normal processing when entering or leaving a todo state. This cycles through the todo states but skips setting timestamps and entering notes which is very convenient when all you want to do is fix up the status of an entry.
(setq org-treat-S-cursor-todo-selection-as-state-change nil)


(global-set-key (kbd "C-c l") #'org-store-link)
(global-set-key (kbd "C-c a") #'org-agenda)
(global-set-key (kbd "C-c c") #'org-capture)
(setq deft-directory org-directory
      deft-extensions '("org")
      deft-recursive t)
(map! "C-c n l" #'org-roam-buffer-toggle
       "C-c n f" #'org-roam-node-find
       "C-c n i"  #'org-roam-node-insert
       "C-c n d" #'org-roam-dailies-capture-today
       "C-c n o" #'org-id-get-create
       "C-c n t" #'org-roam-tag-add
       "C-c n a" #'org-roam-alias-add)
#+end_src


#+RESULTS:
From https://www.reddit.com/r/DoomEmacs//mfr0ed/comment/gsqkr6x/?utm_source=share&utm_medium=web2x&context=3



** Python
Trying out emacs programming for python, following https://www.seas.upenn.edu/~chaoliu/2017/09/01/python-programming-in-emacs/
#+begin_src elisp
(setq
 python-shell-interpreter "ipython"
 python-shell-interpreter-args "-i");

#+end_src

#+RESULTS:
: -i

** Gmail (commented out for now since I don't have time to setup my workflow)
#+begin_src elisp

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; (setq org-refile-targets '((org-index-file :maxlevel . 3)))                          ;;
;;                                                                                      ;;
;; (set-email-account!                                                                  ;;
;;  "matthew@graywolfai.com"                                                            ;;
;;  '((mu4e-sent-folder       . "/[Gmail]/Sent Mail")                                   ;;
;;    (mu4e-trash-folder      . "/[Gmail]/Bin")                                         ;;
;;    (smtpmail-smtp-user     . "matthew@graywolfai.com"))                              ;;
;;  t)                                                                                  ;;
;; (after! mu4e (setq mu4e-get-mail-command "mbsync gmail"                              ;;
;;       ;; get emails and index every 5 minutes                                        ;;
;;       mu4e-update-interval 300                                                       ;;
;; 	  ;; send emails with format=flowed                                             ;;
;; 	  mu4e-compose-format-flowed t                                                  ;;
;; 	  ;; don't need to run cleanup after indexing for gmail                         ;;
;; 	  mu4e-index-cleanup nil                                                        ;;
;; 	  mu4e-index-lazy-check t                                                       ;;
;;       ;; more sensible date format                                                   ;;
;;       mu4e-headers-date-format "%d.%m.%y"))                                          ;;
;; ;; This determines the style of line numbers in effect. If set to `nil', line        ;;
;; ;; numbers are disabled. For relative line numbers, set this to `relative'.          ;;
;; (setq message-send-mail-function 'smtpmail-send-it                                   ;;
;;      smtpmail-stream-type 'starttls                                                  ;;
;;      smtpmail-default-smtp-server "smtp.gmail.com"                                   ;;
;;      smtpmail-smtp-server "smtp.gmail.com"                                           ;;
;;      smtpmail-smtp-service 587)                                                      ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+end_src

#+RESULTS:
: 587


** Setting up terminal
#+begin_src elisp
(map! (:after evil-org
       :map evil-org-mode-map
       :n "c" 'evil-copy
       :n "r" 'evil-redo))
(map! (:after evil-org
       :n "C-c s" 'evil-save
       :n "Q" 'evil-window-next))
(map! (:n "C-c /" 'comment-box))
;;(setq display-line-numbers-type t) ;; <2022-01-17 Mon 17:06> uncommenting while debugging org capture freezing
(setq vterm-shell "/usr/local/bin/zsh")
;;(evil-multiedit-default-keybinds) ;; I think this needs to run in an after block? It's error out

#+end_src

#+RESULTS:
: /usr/local/bin/zsh


