dot_config/doom/config.org
** Citar + Org-Roam
Following  [[https://github.com/bdarcus/citar/blob/37493749bcad63613f01ecad63b2f5628f6f13f8/citar-org.el#L279][citar format note function]] from the citar repo as a guide. I had to edit the format note function to include the ID property for org-roam. A similar thing could be achieved with `org-ref` + `org-ref-bibtex (ORB)` but I wanted to use the newer org-cite with vertico, so I went with citar instead that had its own note templating function that worked with org-roamv2. I've read a bit about how org-roamv2 supports the org-cite format and I'm interpreting from citar's readme (as of <2022-01-18 Tue 07:41>) that the default note formatting function should just work with org-roam v2 through the connection of org-cite, but I wasn't able to see it working without editing it like below. I also don't know if the citation key is the best thing for the org-id. I mainly ue Zotero for bibtex management so Zotero would generate the citations keys from what I understand, assuming they're unique it should be fine. A better solution would probably include hash the citation-key + timestamp, since it's more about uniqueness than determinism I believe

#+begin_src emacs-lisp
(defun my/current-time-string ()
  "calls current-time, then loops through each integer value and converts to string"
  (cl-loop for val in (current-time)
         concat (int-to-string val)))
(defun my/citar-notes-gen-roam-id (key)
  "generate a unique hash id by concating the input 'key' with the string version of current-time"
  (secure-hash 'md5 (concat key (my/current-time-string))))


(after! org-roam
    (org-roam-setup))
(defun my-citar-org-format-note-function (key entry filepath)
  "Format a note FILEPATH from KEY and ENTRY."
    (let* ((template (citar-get-template 'note))
           (note-meta
            (when template
              (citar--format-entry-no-widths
               entry
               template)))
           (buffer (find-file filepath)))
      (with-current-buffer buffer
        ;; This just overrides other template insertion.
        (erase-buffer)
        (citar-org-roam-make-preamble key)
        (insert ":PROPERTIES:\n:ID:     ")
        (insert (my/citar-notes-gen-roam-id key))
        (insert"\n:END:\n")
        (insert "#+title: ")
        (when template (insert note-meta))
        (insert "\n|\n")
        (search-backward "|")
        (delete-char 1)
        (when (fboundp 'evil-insert)
          (evil-insert 1)))))
;;(setq citar-format-note-function #'my-citar-org-format-note-function)

(map! (:n "C-c o" 'citar-open-notes
       :map org-mode-map
       :n "C-c b" 'org-cite-insert
       :n "C-c r" 'citar-refresh))
(map! (:n "C-c /" 'comment-box))

#+end_src

#+RESULTS:
** LSP
*Nix
#+begin_src elisp :results silent
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; (require 'lsp)                                                           ;;
;; (after! lsp                                                              ;;
;;   (add-to-list 'lsp-language-id-configuration '(nix-mode . "nix"))       ;;
;;   (lsp-register-client                                                   ;;
;;    (make-lsp-client :new-connection (lsp-stdio-connection '("rnix-lsp")) ;;
;;                   :major-modes '(nix-mode)                               ;;
;;                   :server-id 'nix)))                                     ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

#+end_src

#+RESULTS:
: (standard-value (nil) custom-type hook custom-package-version (lsp-mode . 7.0.1) variable-documentation Hooks to run after `nix' server is run. custom-requests nil)
