dot_config/doom/config.el

(defun my/current-time-string ()
  "calls current-time, then loops through each integer value and converts to string"
  (cl-loop for val in (current-time)
         concat (int-to-string val)))
(defun my/citar-notes-gen-roam-id (key)
  "generate a unique hash id by concating the input 'key' with the string version of current-time"
  (secure-hash 'md5 (concat key (my/current-time-string))))


(after! org-roam
    (org-roam-setup))
(defun my-citar-org-format-note-function (key entry filepath)
  "Format a note FILEPATH from KEY and ENTRY."
    (let* ((template (citar-get-template 'note))
           (note-meta
            (when template
              (citar--format-entry-no-widths
               entry
               template)))
           (buffer (find-file filepath)))
      (with-current-buffer buffer
        ;; This just overrides other template insertion.
        (erase-buffer)
        (citar-org-roam-make-preamble key)
        (insert ":PROPERTIES:\n:ID:     ")
        (insert (my/citar-notes-gen-roam-id key))
        (insert"\n:END:\n")
        (insert "#+title: ")
        (when template (insert note-meta))
        (insert "\n|\n")
        (search-backward "|")
        (delete-char 1)
        (when (fboundp 'evil-insert)
          (evil-insert 1)))))
;;(setq citar-format-note-function #'my-citar-org-format-note-function)

(map! (:n "C-c o" 'citar-open-notes
       :map org-mode-map
       :n "C-c b" 'org-cite-insert
       :n "C-c r" 'citar-refresh))
(map! (:n "C-c /" 'comment-box))
